var local_database=[
    {
        date: 'Aug 14 2018',
        title: '蔚来汽车3年亏超百亿，只能靠上市来融钱交车？',
        imgSrc: 'https://n.sinaimg.cn/tech/transform/184/w630h354/20180814/9Z1c-fzrwica0826605.jpg',
        avatar: '/images/avatar/1.png',
        content: '8月14日凌晨，蔚来汽车向美国证券交易委员会提交了IPO招股书文件，拟在纽约证券交易所挂牌上市，股票代码为“NIO”，拟筹集最多18亿美元资金。',
        reading: '868648',
        collection: '15648',
        headImgSrc:'https://n.sinaimg.cn/tech/transform/184/w630h354/20180814/9Z1c-fzrwica0826605.jpg',
        author:'唐子祥',
        dataTime:'24time',
        detail: '时隔8年后，李斌再次带领公司赴美上市，这次是蔚来。8月14日凌晨，蔚来汽车向美国证券交易委员会提交了IPO招股书文件，拟在纽约证券交易所挂牌上市，股票代码为“NIO”，拟筹集最多18亿美元资金。这是继2010年带领易车在美国上市之后，李斌带出的第二家上市公司，也是国内造车新势力中即将上市的第一股。招股书显示，在2016年、2017年和截至2018年6月30日的6个月里，蔚来汽车的净亏损分别为25.733亿元人民币、50.212亿元人民币（约合7.588亿美元）和33.255亿元人民币（约合5.026亿美元）。不到三年就已亏出109亿元，蔚来汽车的现状引人注意。而且除了亏损外，蔚来首款量产车型ES8的交付时间也是一拖再拖，从3月到5月再到现在，不少用户质疑“今年卖出100辆车了吗？”现在，在大面积交付之前蔚来选择赴美上市，为自身又增添了不少话题。',
        postId:0,
        music: {
            url: 'http://sc1.111ttt.com/2016/1/09/28/202280605509.mp3',
            title: '青云志',
            coverImgUrl: 'http://r1.ykimg.com/050E0000576B75F667BC3C136B06E4E7'
        }

    },
    {
        //按住alt + shift + f可以格式化代码
        date: 'Aug 13 2018',
        title: '足不出户月入过万的网络刷单 背后是精心骗局',
        imgSrc: 'https://n.sinaimg.cn/tech/crawl/168/w550h418/20180814/3FYz-fzrwica0854953.jpg',
        avatar: '/images/avatar/2.png',
        content: '虚假信息一直是互联网诚信建设的一大顽疾，而且由于需求非常旺盛，刷单逐渐形成了一条隐秘而庞大的产业链，参与者众多。更有不少做着在家动动手指就可以月收入过万美梦的人，要么成了网络黑产的助纣为虐者，要么成为了网络诈骗的受害者。',
        reading: '118676',
        collection: '29645',
        headImgSrc:'https://n.sinaimg.cn/tech/crawl/168/w550h418/20180814/3FYz-fzrwica0854953.jpg',
        author:'李一天',
        dataTime:'24time',
        detail: '无论是刷单炒信，还是点赞刷粉丝，都需要注册大量的账户。现在各大互联网平台为了防止恶意注册“僵尸账户”，一般采用两种方式规避：一是要求绑定手机号码注册，手机号码一般需要实名验证，而且个人用户能够开通的手机号码有数量限制；二是注册时需要输入复杂图片验证码或者短信验证码，这样可以规避机器大量自动注册。于是，为了满足这两个条件，就产生了处在“刷单江湖”源头的两大角色：卡商和打码平台。所谓“卡商”，就是指拥有大量手机“黑卡”的人，这种卡的市场价格一般在10元左右一张，其中很多是经过实名认证的,且有很多属于0月租、0余额的特殊卡。卡商将大量经由“合法”或者非法途径获得的SIM卡，插进一个名为“猫池”的设备中，就可以自动地同时向多个手机发送短信或语音呼叫。可以说手机“黑卡”就是互联网黑产的“原油”，成为不法业务的“生产资料”。比如，最传统的发送垃圾短信，拨打推销电话以及进行“转账汇款、恭喜中奖、冒充好友借钱”等电信诈骗……当然，还有一个重要的“业务”就是通过“猫池”和打码平台提供的软件，进行账户注册和其他操作，比如刷单、刷钻、刷会员、刷流量、刷粉丝、薅羊毛……这时，打码平台就出场了。很多互联网业务操作都需要输入复杂图片验证码或者短信验证码。前者用来识别正在操作的是真正的人类用户还是机器程序，常见方式有在晃动或者杂乱背景中识别并选择正确的数字和字母，或者按顺序选择多个汉字中的几个等。后者则用来过滤掉低价值用户（编者注：大多数普通互联网用户并不频繁更换手机号，所以可以基于手机号对应的行为来建立基于手机的征信库，从而基于手机号的信誉实现筛选出高价值客户功能）及提供二次校验功能。为了搞定这些验证码，打码平台会与网赚平台（提供各种互联网招聘赚钱信息的网站）合作，通过各种招聘和兼职信息网站发布招聘信息，招聘一些人专门人工输入验证码。“在家兼职、日赚1000元”“轻松赚钱、快乐赚钱”等是这类招聘信息常见的广告语。比如，12306的网站验证码就非常复杂，虽然经常被吐槽“反人类”，比如都是像“请点击下图中所有的发电机”“请点击下图中所有的非EXO成员”等验证题目，但它确实做到了程序较难识别的目的。因此，据一些打码平台的报价，打码12306是要比普通验证码贵很多的。有了大量的手机号码和用其注册的账户，一家公司就可以控制上万甚至几十万“人”，他们的行为有时都足以影响一个互联网公司的健康发展甚至生死存亡。',
        postId:1,
        music: {
            url: 'http://ws.stream.qqmusic.qq.com/M500001VfvsJ21xFqb.mp3?guid=ffffffff82def4af4b12b3cd9337d5e7&uin=346897220&vkey=6292F51E1E384E06DCBDC9AB7C49FD713D632D313AC4858BACB8DDD29067D3C601481D36E62053BF8DFEAF74C0A5CCFADD6471160CAF3E6A&fromtag=46',
            title: '此时此刻'
        }
    },
    {
        //按住alt + shift + f可以格式化代码
        date: 'Aug 13 2018',
        title: '特朗普签署法案 禁止政府使用华为和中兴部分技术',
        imgSrc: 'https://n.sinaimg.cn/tech/transform/246/w630h416/20180814/FBa9-hhtfwqq8689451.png',
        avatar: '/images/avatar/3.png',
        content: '根据外媒The Verge报道，美国特朗普总统今天签署了一项新法案。作为《国防授权法案》的一部分，该法案禁止美国政府和政府承包商使用华为和中兴的部分技术。',
        reading: '564112',
        collection: '53496',
        headImgSrc:'https://n.sinaimg.cn/tech/transform/246/w630h416/20180814/FBa9-hhtfwqq8689451.png',
        author:'白一冰',
        dataTime:'24time',
        detail: '根据外媒The Verge报道，美国特朗普总统今天签署了一项新法案。作为《国防授权法案》的一部分，该法案禁止美国政府和政府承包商使用华为和中兴的部分技术。这项法案的签署结束了几个月来共和党人的争议，他们中许多人都将中国两大电信公司视作为是国家安全威胁。今年6月，美国参议院以压倒性的投票通过了一项修正案，恢复了对于中兴的贸易禁令，而此举有可能会直接导致公司暂停运转。然而，众议院却没有这样做。那么现在最大的问题就在于两院之间将如何达成妥协，抑或是它们是否会彻底搁置这一事情。最终，美国国会决定采取一项措施，基本上禁止了美国政府或任何希望与美国政府合作的人使用华为、中兴或其他一些中国通信公司提供的零部件。这项禁令将在未来两年内生效。禁令包括华为和中兴的零部件或是对采用这些零部件系统“至关重要”的服务。不过，这些公司的许多零部件仍然是被允许使用的，前提是它们不被用于路由或查看数据。该法案还指示包括联邦通信委员会（Federal Communications Commission）在内的几家政府机构要优先为那些因禁令不得不改变技术的企业提供资金援助。在一封邮件声明中，华为称这项禁令为国防法案的“随意补充”，这是“无效、具有误导性且不符合宪法规定的”。华为表示这项禁令将增加消费者和企业的成本，且它并不能“辨明真正的安全风险或改善供应链安全”。华为没有立刻表示自己将会对这项法案提出质疑。目前尚不清楚国会将采取何种行动，尤其是考虑到特朗普不想恢复对中兴的贸易禁令，甚至于是试图解除禁令。美国商务部已经通过谈判达成了一项协议并解除了禁令。目前尚不清楚特朗普是否会签署一项法案来推翻这些决定。一直以来，华为和中兴始终是美国法律和政策制定者的针对目标。2012年众议院的一份报告称，这两家公司都对美国国家安全造成了威胁。美国安全机构负责人还建议不要使用这两家公司的产品。尽管该法案并未完全禁止两家公司为美国基础设施服务，但它会迫使许多希望与政府合作的公司选择其他供应商，移除它们已经在使用的华为和中兴零部件，进而对华为和中兴两家公司造成严重影响。',
        postId:2
    },
    {
        //按住alt + shift + f可以格式化代码
        date: 'Aug 142018',
        title: '英伟达面向电影制作者推出新一代“图灵”芯片',
        imgSrc: 'https://n.sinaimg.cn/tech/transform/249/w630h419/20180814/vGdI-hhtfwqq6732145.png',
        avatar: '/images/avatar/4.png',
        content: '　新浪科技讯 北京时间8月14日上午消息，英伟达周一发布新一代芯片，希望在电影制作和其他专业图形领域进一步扩大业务。在周一的一次专业图形机构会议上，英伟达推出了最新一代“图灵”芯片技术，以英国传奇计算机科学家阿兰·图灵（Alan Turing）的名字命名',
        reading: '878678',
        collection: '54687',
        headImgSrc:'https://n.sinaimg.cn/tech/transform/249/w630h419/20180814/vGdI-hhtfwqq6732145.png',
        author:'王德胜',
        dataTime:'24time',
        detail: '新浪科技讯 北京时间8月14日上午消息，英伟达周一发布新一代芯片，希望在电影制作和其他专业图形领域进一步扩大业务。在周一的一次专业图形机构会议上，英伟达推出了最新一代“图灵”芯片技术，以英国传奇计算机科学家阿兰·图灵（Alan Turing）的名字命名。这款芯片的最大卖点是提升了所谓的“ray tracing”功能，可以让芯片模拟光线在虚拟场景中的效果。这项任务需要消耗很大计算资源，因此设计师必须等待芯片运行一段时间才能看到结果。英伟达则表示，该公司的新一代芯片可以让设计师实时看到变化，从而加快创意流程，因此英伟达希望客户愿意为此支付溢价。“图灵是英伟达最近十多年以来，在电脑图形领域最重要的创新。”英伟达创始人兼CEO黄仁勋在声明中说。英伟达股价过去一年累计涨幅超过50 %，主要是受到数据芯片销售额在上一财年翻番至19亿美元的刺激。英伟达的数据中心芯片为人工智能任务提供支持，训练电脑识别图像，而且逐渐蚕食了英特尔的增长机会。作为英伟达最大的业务，其消费芯片可以让视频游戏玩家运行精细图形，这项业务最近一个财年增长35 %，营收达到55亿美元。这一增长源自众多热门游戏的推出以及加密货币挖矿需求。但瞄准专业图形和设计人士的中端产品表现平平，去年仅增长11.8 %，营收9.34亿美元。Moor Insights and Strategy分析师帕特里克·莫海德（Patrick Moorhead）表示，英伟达可能希望在与AMD的竞争中先发制人，后者可能在明年凭借新的图形芯片瞄准同一批专业用户。英伟达在数据中心市场和高端游戏市场目前所占有的优势，使之最容易在中端市场遭遇攻击。',
        postId:3
    },
    {
        //按住alt + shift + f可以格式化代码
        date: 'Aug 16 2018',
        title: '为什么人工智能的研究都是基于算法，而不是基于“硬件”？',
        imgSrc: 'https://inews.gtimg.com/newsapp_match/0/4851790486/0',
        avatar: '/images/avatar/4.png',
        content: '为啥研究人工智能就研究算法而不做硬件？其实这两方面都有人做，各司其职，做算法的人研究如何运用卷积神经网络进行识别，面对爆炸的信息量如何最大化榨取处理器的计算能力。而做硬件的行业操心如何能让其核心拥有更强大的计算单元，更低的功耗。',
        reading: '578678',
        collection: '14687',
        headImgSrc: 'https://n.sinaimg.cn/tech/transform/249/w630h419/20180814/vGdI-hhtfwqq6732145.png',
        author: '王德胜',
        dataTime: '24time',
        detail: '首先，问题就有问题。人工智能的研究既基于算法，又需要硬件。NVIDIA每年更新显卡都不只是更新gtx 680、gtx780…gtx1080这些游戏显卡。如果你对人工智能、支持向量机、卷积神经网络等有了解，那你应该知道每次NVIDIA发布新卡都会有丽台的卡，价格比游戏显卡昂贵，从丽台 p100到p4000到现在的丽台GV100。每一次更新其计算能力都发生了飞跃。那么问题来了，为啥研究人工智能就研究算法而不做硬件？其实这两方面都有人做，各司其职，做算法的人研究如何运用卷积神经网络进行识别，面对爆炸的信息量如何最大化榨取处理器的计算能力。而做硬件的行业操心如何能让其核心拥有更强大的计算单元，更低的功耗。现在，人工智能面临的问题不是快和慢，而是有些事情做不到。根据现有的计算理论：即使把神经元近似的实现为一些计算芯片，即使用CMOS的方式搭出一个神经网络，它的计算能力和用软件写出来的卷积神经网络并没有本质的区别。目前人工智能发展的困难不在于是否用硬件实现，而在于算法。',
        postId: 4
    }
]
module.exports={
    postList : local_database
}